## Librerias

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.options.display.max_columns = False

## **1. Introducción a pandas**

### **1.1 Series**

<ul>
    <li>Son arreglos unidimensionales indexados.</li>
    <li>Nos permiten hacer slicing y buscar por el índice.</li>
    <li>Tambien nos permiten realizar operaciones matemáticas.</li>
    <li>Reciben distintos tipos de datos.</li>
</ul>

In [3]:
a = pd.Series(
    ['El ojo del mundo', 'La gran cacería', 'El dragón renacido', 'El ascenso de la sombra', 'El dragón renacido'],
    index=[1, 2, 3, 4, 5]
)
a

1           El ojo del mundo
2            La gran cacería
3         El dragón renacido
4    El ascenso de la sombra
5         El dragón renacido
dtype: object

### **1.2 DataFrames**

<ul>
    <li>Son la estructura principal de <strong>pandas</strong>.</li>
    <li>Son arreglos de dos dimensiones.</li>
    <li>Vienen indexados por lo que facilitan la búsqueda por columnas o filas.</li>
</ul>

#### **Leyendo archivos**

In [72]:
books = pd.read_csv('Data/bestsellers.csv')

In [5]:
characters = pd.read_json('Data/characters.json')

#### **Filtrando un DataFrame I**

In [6]:
# Hacer slicing con las filas
books[0:4]

                                      Name  ...        Genre
0            10-Day Green Smoothie Cleanse  ...  Non Fiction
1                        11/22/63: A Novel  ...      Fiction
2  12 Rules for Life: An Antidote to Chaos  ...  Non Fiction
3                   1984 (Signet Classics)  ...      Fiction

[4 rows x 7 columns]

In [7]:
# Seleccionar por columnas
books[['Name', 'Author', 'Year']]

                                                  Name  ...  Year
0                        10-Day Green Smoothie Cleanse  ...  2016
1                                    11/22/63: A Novel  ...  2011
2              12 Rules for Life: An Antidote to Chaos  ...  2018
3                               1984 (Signet Classics)  ...  2017
4    5,000 Awesome Facts (About Everything!) (Natio...  ...  2019
..                                                 ...  ...   ...
545       Wrecking Ball (Diary of a Wimpy Kid Book 14)  ...  2019
546  You Are a Badass: How to Stop Doubting Your Gr...  ...  2016
547  You Are a Badass: How to Stop Doubting Your Gr...  ...  2017
548  You Are a Badass: How to Stop Doubting Your Gr...  ...  2018
549  You Are a Badass: How to Stop Doubting Your Gr...  ...  2019

[550 rows x 3 columns]

#### **Utilizando Loc**

In [8]:
# Usando Loc
books.loc[0:4, ['Name', 'Author']]

                                                Name                    Author
0                      10-Day Green Smoothie Cleanse                  JJ Smith
1                                  11/22/63: A Novel              Stephen King
2            12 Rules for Life: An Antidote to Chaos        Jordan B. Peterson
3                             1984 (Signet Classics)             George Orwell
4  5,000 Awesome Facts (About Everything!) (Natio...  National Geographic Kids

In [9]:
# Usando Loc
books.loc[:, ['Reviews']]

     Reviews
0      17350
1       2052
2      18979
3      21424
4       7665
..       ...
545     9413
546    14331
547    14331
548    14331
549    14331

[550 rows x 1 columns]

#### **Utilizando Iloc**

In [10]:
books.iloc[:5, 0:3]

                                                Name  ... User Rating
0                      10-Day Green Smoothie Cleanse  ...         4.7
1                                  11/22/63: A Novel  ...         4.6
2            12 Rules for Life: An Antidote to Chaos  ...         4.7
3                             1984 (Signet Classics)  ...         4.7
4  5,000 Awesome Facts (About Everything!) (Natio...  ...         4.8

[5 rows x 3 columns]

#### **Agregar datos**

In [37]:
# Agregar columnas
books['Nueva columna'] = np.nan

In [36]:
data = np.arange(0, len(books))
books['Rango'] = data

In [38]:
books.head(3)

                                      Name  ... Rango
0            10-Day Green Smoothie Cleanse  ...     0
1                        11/22/63: A Novel  ...     1
2  12 Rules for Life: An Antidote to Chaos  ...     2

[3 rows x 8 columns]

In [41]:
# Agregar filas
books.append(books).head()

                                                Name  ... Rango
0                      10-Day Green Smoothie Cleanse  ...     0
1                                  11/22/63: A Novel  ...     1
2            12 Rules for Life: An Antidote to Chaos  ...     2
3                             1984 (Signet Classics)  ...     3
4  5,000 Awesome Facts (About Everything!) (Natio...  ...     4

[5 rows x 8 columns]

In [47]:
books.append(
    {
        'Name': 'The dragon reborn',
        'Author': 'Robert Jordan',
        'Genre': 'Fiction'
    }, 
    ignore_index=True)

                                                  Name  ...  Rango
0                        10-Day Green Smoothie Cleanse  ...    0.0
1                                    11/22/63: A Novel  ...    1.0
2              12 Rules for Life: An Antidote to Chaos  ...    2.0
3                               1984 (Signet Classics)  ...    3.0
4    5,000 Awesome Facts (About Everything!) (Natio...  ...    4.0
..                                                 ...  ...    ...
546  You Are a Badass: How to Stop Doubting Your Gr...  ...  546.0
547  You Are a Badass: How to Stop Doubting Your Gr...  ...  547.0
548  You Are a Badass: How to Stop Doubting Your Gr...  ...  548.0
549  You Are a Badass: How to Stop Doubting Your Gr...  ...  549.0
550                                  The dragon reborn  ...    NaN

[551 rows x 8 columns]

#### **Eliminar datos**

In [14]:
# Eliminar columnas
books.drop('Genre', axis=1).head()

                                                Name  ...  Year
0                      10-Day Green Smoothie Cleanse  ...  2016
1                                  11/22/63: A Novel  ...  2011
2            12 Rules for Life: An Antidote to Chaos  ...  2018
3                             1984 (Signet Classics)  ...  2017
4  5,000 Awesome Facts (About Everything!) (Natio...  ...  2019

[5 rows x 6 columns]

In [24]:
# Eliminar columnas II
del books['Year']

In [23]:
# Eliminar filas
books.drop([2,4], axis=0)

                                                  Name  ...        Genre
0                        10-Day Green Smoothie Cleanse  ...  Non Fiction
1                                    11/22/63: A Novel  ...      Fiction
3                               1984 (Signet Classics)  ...      Fiction
5        A Dance with Dragons (A Song of Ice and Fire)  ...      Fiction
6    A Game of Thrones / A Clash of Kings / A Storm...  ...      Fiction
..                                                 ...  ...          ...
545       Wrecking Ball (Diary of a Wimpy Kid Book 14)  ...      Fiction
546  You Are a Badass: How to Stop Doubting Your Gr...  ...  Non Fiction
547  You Are a Badass: How to Stop Doubting Your Gr...  ...  Non Fiction
548  You Are a Badass: How to Stop Doubting Your Gr...  ...  Non Fiction
549  You Are a Badass: How to Stop Doubting Your Gr...  ...  Non Fiction

[548 rows x 7 columns]

#### **Trabajando con valores nulos**

In [52]:
df = pd.DataFrame(
    {
        'Name': ['El dragon renacido', 'El señor del Caos', 'Un recuerdo de Luz', np.nan],
        'Número': [3, np.nan, 14, 0],
        'Año': [2002, 2004, None, 2010]
    }
)

In [56]:
# Identificar los valores nulos
df.isna()

    Name  Número    Año
0  False   False  False
1  False    True  False
2  False   False   True
3   True   False  False

In [59]:
# Convertirlos en booleanos
df.isna()*1

   Name  Número  Año
0     0       0    0
1     0       1    0
2     0       0    1
3     1       0    0

In [60]:
# Reemplazando los valores nulos
df.fillna('Missing')

                 Name   Número      Año
0  El dragon renacido      3.0   2002.0
1   El señor del Caos  Missing   2004.0
2  Un recuerdo de Luz     14.0  Missing
3             Missing      0.0   2010.0

In [63]:
# Eliminar valores nulos
df.dropna()

                 Name  Número     Año
0  El dragon renacido     3.0  2002.0

### **1.3 Principales funciones de pandas**

#### **Funciones básicas**

In [75]:
# Conocer información del DataFrame
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         550 non-null    object
 1   Author       550 non-null    object
 2   User Rating  550 non-null    float64
 3   Reviews      550 non-null    int64
 4   Price        550 non-null    int64
 5   Year         550 non-null    int64
 6   Genre        550 non-null    object
dtypes: float64(1), int64(3), object(3)
memory usage: 30.2+ KB

In [79]:
# Información estadística de las variables numericas
books.describe()

       User Rating       Reviews       Price         Year
count   550.000000    550.000000  550.000000   550.000000
mean      4.618364  11953.281818   13.100000  2014.000000
std       0.226980  11731.132017   10.842262     3.165156
min       3.300000     37.000000    0.000000  2009.000000
25%       4.500000   4058.000000    7.000000  2011.000000
50%       4.700000   8580.000000   11.000000  2014.000000
75%       4.800000  17253.250000   16.000000  2017.000000
max       4.900000  87841.000000  105.000000  2019.000000

In [83]:
# Ver el uso de memoria
books.memory_usage(deep=True)

Index            128
Name           59737
Author         39078
User Rating     4400
Reviews         4400
Price           4400
Year            4400
Genre          36440
dtype: int64

In [87]:
# Contar los registros por autor
books['Author'].value_counts()

Jeff Kinney                           12
Gary Chapman                          11
Rick Riordan                          11
Suzanne Collins                       11
American Psychological Association    10
                                      ..
Keith Richards                         1
Chris Cleave                           1
Alice Schertle                         1
Celeste Ng                             1
Adam Gasiewski                         1
Name: Author, Length: 248, dtype: int64

In [93]:
# Eliminar duplicados
books.drop_duplicates(subset='Author')

                                                  Name  ...        Genre
0                        10-Day Green Smoothie Cleanse  ...  Non Fiction
1                                    11/22/63: A Novel  ...      Fiction
2              12 Rules for Life: An Antidote to Chaos  ...  Non Fiction
3                               1984 (Signet Classics)  ...      Fiction
4    5,000 Awesome Facts (About Everything!) (Natio...  ...  Non Fiction
..                                                 ...  ...          ...
537  Wild: From Lost to Found on the Pacific Crest ...  ...  Non Fiction
538  Winter of the World: Book Two of the Century T...  ...      Fiction
539  Women Food and God: An Unexpected Path to Almo...  ...  Non Fiction
540                                             Wonder  ...      Fiction
546  You Are a Badass: How to Stop Doubting Your Gr...  ...  Non Fiction

[248 rows x 7 columns]

In [100]:
books['Year'].skew()

0.0